a=input("жук без ж первая л  какое слово?")
if a=="лук":
    print("молодец 1 этап пройдень")
    h=input("следуящая головоломка  (нада сказать дальше)")
else:
    print("не правильно конец")
if h=="дальше":
    y=input("ква+рак-ак+тира")
else:
    print("не правильно конец")
if y=="квартира":
    print("молодец 2 этап пройдень")
    k=input("кот+ёлка-ка")
else:
    print("не правильно конец")
if k=="котёл":
    print("молодец 3 этап пройдень")
    l=input("ты прошёл самый лёгкий этап 1 уровень продолжить? да или нет")
else:
    print("не правильно конец")
if l=="да":
    i=input("гитара без первой буквы и последних две лиса без последних 2 букв и я")
else:
    print("не правильно конец")
if i=="Италия":
    t=input("л закрашана мягкими знаками маша перевёрнутая без первой и последней буквы")
else:
    print("не правильно конец")
if t=="польша":
    q=input("молодец ты прошёл 2 этап следующий да или нет")
else:
    print("не правильно конец")
if q=="да":
    m=input("перевёрнутый гриб без 2 последних букв молоток без первой буквы и 3 последних букв и г")
if m=="биолог":
    print("молодец")
    b=input("шар без последней буквы x томаты без двух первых букв")
else:
    print("не правильно конец")
if  b=="шахматы":
    v=input("з перевёрнутая роза")
else:
    print("не правильно конец")
if v=="забор":
    print("третий этап пройден")
    j=input("три кошки и ж")
else:
    print("не правильно конец")
if j=="Трикотаж":
    w=input("Н виде сала")
else:
    print("не правильно конец")
if w=="салон":
    print(" молодец вы прошли и вы получили дом!!!!!")





    

    
    

